software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/CQL2-allParticipants.xml

<soapenv:Envelope 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:dat="http://org.cagrid.dataservice/DataService" 
xmlns:org="http://CQL.caBIG/2/org.cagrid.cql2">
   <soapenv:Header/>
   <soapenv:Body>
      <dat:ExecuteQueryRequest>
         <dat:query>
            <ns1:CQLQuery xmlns:ns1="http://CQL.caBIG/2/org.cagrid.cql2">
               <ns1:CQLTargetObject className="edu.wustl.catissuecore.domain.Participant"/>

               <ns1:AssociationPopulationSpecification>
                  <ns1:NamedAssociationList>
                     <ns1:NamedAssociation endName="participantMedicalIdentifierCollection"/>
                  </ns1:NamedAssociationList>
               </ns1:AssociationPopulationSpecification>

            </ns1:CQLQuery>
         </dat:query>
      </dat:ExecuteQueryRequest>
   </soapenv:Body>
</soapenv:Envelope>